<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fa1b0fbc891c96366fbf12e8ac9b9a93dcc4dc261dc8c2a1b0b44d776493c684","plan_job_ref":"Job .github/workflows/_test-tf.yaml #290 at https://github.com/tx-pts-dai/github-workflows/actions/runs/13516276044","plan_out_hash":"d96eca33565bc775ea61c42cfa1fd5d898418271975aad16639bcd8f103badf9","plan_hash":"1356e7d2d864c86b953f64b93a37effbff0e94e2b9b38f1b278cb56412300d05","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #290](https://github.com/tx-pts-dai/github-workflows/actions/runs/13516276044)